`timescale 1ns / 1ps
//////////////////////////////////////////////////////////////////////////////////
// ALU模块，实现各种算术逻辑运算
//////////////////////////////////////////////////////////////////////////////////
module alu(
    input wire [15:0] in1,    // 输入1，来自累加器
    input wire [15:0] in2,    // 输入2，来自数据存储器
    input wire [3:0] alu_op,  // 操作码，决定ALU的功能
    output reg ct,            // 条件转移信号，用于BAN指令
    output reg [15:0] Z       // 运算结果
);
    // 初始化输出信号
    initial begin
        ct = 0;
        Z = 0;
    end
    
    // 根据操作码进行不同的运算
    always@(*) begin
        case(alu_op)
            4'b0000: Z = 16'h0000;                      // CLA: 清除累加器
            4'b0001: Z = ~in1;                          // COM: 累加器取反
            4'b0010: Z = {in1[15], in1[15:1]};          // SHR: 算术右移一位
            4'b0011: Z = {in1[14:0], in1[15]};          // CSL: 循环左移一位
            4'b0100: Z = in1 + in2;                     // ADD: 加法
            4'b0101: Z = in1;                           // STA: 存数（保持输入不变）
            4'b0110: Z = in2;                           // LDA: 取数（将输入2传递到输出）
            4'b0111: Z = in1;                           // JMP: 无需ALU操作
            4'b1000: begin                              // BAN: 检查累加器最高位
                     Z = in1;                           // 保持累加器值不变
                     ct = (in1[15] == 1) ? 1 : 0;       // 如果ACC为负数，设置条件转移信号
                     end
            4'b1001: Z = in1;                           // STP: 无需ALU操作
            default: Z = 16'h0000;                      // 默认情况，清零
        endcase
    end
endmodule 